heatSolverFEniCSx_OpenFOAM/caseB/fluid/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    leftWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    rightWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fluid_to_solid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
